# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5 # number of classes
ch: 4
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  # s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  # m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  # l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Split, [1, [3, 1]]] # 0 (dim=1, split=[3, 1])
  - [0, 1, GetFrom, [0]] # 1 (rgb-input)
  - [0, 1, GetFrom, [1]] # 2 (ir-input)

  # stage 1-2
  ## rgb
  - [1, 1, Conv, [64, 3, 2]] # 3-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 4-P2/4
  ## ir
  - [2, 1, Conv, [64, 3, 2]] # 5-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 6-P2/4
  ## fusion
  - [4, 1, nn.AvgPool2d, [8, 8]] # 7
  - [6, 1, nn.AvgPool2d, [8, 8]] # 8
  - [[7, 8], 3, CMSABlock, []] # 9
  ## fusion to rgb
  - [9, 1, GetFrom, [0]] # 10
  - [-1, 1, nn.Upsample, [None, 8, 'bilinear']] # 11
  - [[-1, 4], 1, Add, []] # 12-P2/4
  ## fusion to ir
  - [9, 1, GetFrom, [1]] # 13
  - [-1, 1, nn.Upsample, [None, 8, 'bilinear']] # 14
  - [[-1, 6], 1, Add, []] # 15-P2/4

  # stage 3
  ## rgb
  - [12, 2, C3k2, [256, False, 0.25]] # 16
  - [-1, 1, Conv, [256, 3, 2]] # 17-P3/8
  ## ir
  - [15, 2, C3k2, [256, False, 0.25]] # 18
  - [-1, 1, Conv, [256, 3, 2]] # 19-P3/8
  ## fusion
  - [17, 1, nn.AvgPool2d, [4, 4]] # 20
  - [19, 1, nn.AvgPool2d, [4, 4]] # 21
  - [[20, 21], 3, CMSABlock, []] # 22
  ## fusion to rgb
  - [22, 1, GetFrom, [0]] # 23
  - [-1, 1, nn.Upsample, [None, 4, 'bilinear']] # 24
  - [[-1, 17], 1, Add, []] # 25-P3/8
  ## fusion to ir
  - [22, 1, GetFrom, [1]] # 26
  - [-1, 1, nn.Upsample, [None, 4, 'bilinear']] # 27
  - [[-1, 19], 1, Add, []] # 28-P3/8

  # stage 4
  ## rgb
  - [25, 2, C3k2, [512, False, 0.25]] # 29
  - [-1, 1, Conv, [512, 3, 2]] # 30-P4/16
  ## rgb
  - [28, 2, C3k2, [512, False, 0.25]] # 31
  - [-1, 1, Conv, [512, 3, 2]] # 32-P4/16
  ## fusion
  - [30, 1, nn.AvgPool2d, [2, 2]] # 33
  - [32, 1, nn.AvgPool2d, [2, 2]] # 34
  - [[33, 34], 3, CMSABlock, []] # 35
  ## fusion to rgb
  - [35, 1, GetFrom, [0]] # 36
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']] # 37
  - [[-1, 30], 1, Add, []] # 38-P4/16
  ## fusion to ir
  - [35, 1, GetFrom, [1]] # 39
  - [-1, 1, nn.Upsample, [None, 2, 'bilinear']] # 40
  - [[-1, 32], 1, Add, []] # 41-P4/16

  # stage 5
  ## rgb
  - [38, 2, C3k2, [512, True]] # 42
  - [-1, 1, Conv, [1024, 3, 2]] # 43-P5/32
  - [-1, 2, C3k2, [1024, True]] # 44
  - [-1, 1, SPPF, [1024, 5]] # 45
  - [-1, 2, C2PSA, [1024]] # 46
  ## ir
  - [41, 2, C3k2, [512, True]] # 47
  - [-1, 1, Conv, [1024, 3, 2]] # 48-P5/32
  - [-1, 2, C3k2, [1024, True]] # 49
  - [-1, 1, SPPF, [1024, 5]] # 50
  - [-1, 2, C2PSA, [1024]] # 51
  ## fusion
  - [[46, 51], 3, CMSABlock, []] # 52
  ## fusion to rgb
  - [52, 1, GetFrom, [0]] # 53
  - [[-1, 46], 1, Add, []] # 54-P5/32
  ## fusion to ir
  - [52, 1, GetFrom, [1]] # 55
  - [[-1, 51], 1, Add, []] # 56-P5/32

  # fusion
  - [[12, 15], 1, Concat, []] # 57
  - [-1, 1, Conv, [128, 3, 1]] # 58-P2/4
  - [[25, 28], 1, Concat, []] # 59
  - [-1, 1, Conv, [256, 3, 1]] # 60-P3/8
  - [[38, 41], 1, Concat, []] # 61
  - [-1, 1, Conv, [512, 3, 1]] # 62-P4/16
  - [[54, 56], 1, Concat, []] # 63
  - [-1, 1, Conv, [1024, 3, 1]] # 64-P5/32

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 65
  - [[-1, 62], 1, Concat, [1]] # 66-cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 67

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 68
  - [[-1, 60], 1, Concat, [1]] # 69-cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 70

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 71
  - [[-1, 58], 1, Concat, [1]] # 72-cat backbone P2
  - [-1, 2, C3k2, [256, False]] # 73 

  - [-1, 1, Conv, [256, 3, 2]] # 74
  - [[-1, 70], 1, Concat, [1]] # 75-cat head P4
  - [-1, 2, C3k2, [512, False]] # 76 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 77
  - [[-1, 67], 1, Concat, [1]] # 78-cat head P4
  - [-1, 2, C3k2, [512, False]] # 79 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 80
  - [[-1, 64], 1, Concat, [1]] # 81-cat head P5
  - [-1, 2, C3k2, [1024, True]] # 82 (P5/32-large)

  - [[76, 79, 82], 1, Detect, [nc]] # Detect(P3, P4, P5)
